{"creature":{},"item":{"Walking Cane":{"valid":true,"name":"Walking Cane","description":"A seemingly ordinary walking cane, crafted from a single, exceptionally strong limb of hardwood.  Upon closer inspection, faint etchings run along the shaft, hinting at a deeper purpose.","short_description":"A sturdy limb of hard wood.","equip":"The cane is well-balanced and fits comfortably in the hand.  A smooth, polished knob adorns the top, providing a secure grip.  When not in use, it can be hooked onto the arm or strapped to a pack.","history":"Legends whisper of these canes being carried by travelers who ventured beyond the known world.  Some believe they possess a connection to the land itself, granting those who wield them a deeper sense of balance and awareness on their journeys.  Others scoff at such tales, dismissing them as mere folklore.","effect":"While the cane provides sturdy support, whispers persist that for those attuned to its magic, the cane subtly enhances their balance and connection to the ground.  It may even offer a faint echo of warnings, tingling slightly in the hand when danger approaches.","sprite":"sturdyCane","version":2}},"spell":{"Assist":{"valid":true,"name":"Assist","description":"The caster chants a powerful, yet personalized, mantra passed down through generations of shamans. This mantra calls upon the spirits of the natural world, or a specific deity depending on the shaman's tradition, to grant a moment of assistance.","school":"Shamanism","components":"Verbal (Secret Mantra)","appearance":"As the shaman chants, their eyes may flicker with a faint inner light that reflects the energy being channeled. Wisps of smoke or shimmering motes of light may briefly dance around the target's hand or the shaman's own, depending on who is receiving the aid.","lore":"The Assist spell is a cornerstone of shamanic practice.  It embodies the concept of living in harmony with the natural world and seeking aid from the spirits that reside within it.  The effectiveness of the spell is said to be influenced by the strength of the shaman's connection to their patron or the spirits, as well as the sincerity and focus of the chanted mantra.","targets":"One willing creature (self or another)","sprite":"assist","version":1}}}